print('Добро пожаловать!')

user_name = input('Как Вас зовут?') #Запрос имени пользователя
user_age = int(input('Сколько Вам лет?')) #Запрос возраста пользователя

user_weight = float(input('Укажите Ваш вес в килограммах (например, 80.2): ')) #Запрос веса пользователя
user_height = float(input('Укажите Ваш рост в метрах (например, 1.65): ')) #Запрос роста пользователя
 
bmi = round(user_weight / (user_height ** 2), 1) #Расчет ИМТ пользователя с округлением
print(f'\n{user_name}, Ваш индекс массы тела равен: {bmi}') #Вывод округленного ИМТ

water_ml = user_weight * 30 #Расчет нормы воды
water_l = water_ml / 1000
print(f"Рекомендуемая норма вода: {water_l} л ({water_ml} мл)")

report = f"""Вот отчет для тебя: {user_name}, {user_age} лет. Твой индекс массы теля равен: {bmi:.1f}  Рекомендуемая норма воды {water_l:.2f} л"""



print("Расчет окончен. Будьте здоровы!")